eisup_2019_docmng_integration/src/Documents/ttk_ФормированиеРезерва/ttk_ФормированиеРезерва.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_ФормированиеРезерва</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезервеНаСкладах</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПриемник</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ttk_ФормированиеРезерваВидОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСУчетомСерии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрОснование</name>
    <type>
      <types>EnumRef.ВидыРегистровОснованийРегистраСвободныеОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ТоварыВРезервеНаСкладах/ТоварыВРезервеНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезервеНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ttk_ФормированиеРезерваВидОперации/ttk_ФормированиеРезерваВидОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ttk_ФормированиеРезерваВидОперации</name>
  <enumValues>
    <name>УстановкаРезерва</name>
  </enumValues>
  <enumValues>
    <name>СнятиеРезерва</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеРезерва</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_ФормированиеРезерва/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СвободныеОстатки.Записывать=Истина;
	Движения.СвободныеОстатки.Записать();
	
	Движения.ТоварыВРезервеНаСкладах.Записывать=Истина;
	Движения.ТоварыВРезервеНаСкладах.Очистить();

	Если ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.УстановкаРезерва Тогда
	
			Запрос = новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ФормированиеРезерваТовары.Номенклатура,
			               |	ФормированиеРезерваТовары.Характеристика,
			               |	ФормированиеРезерваТовары.СерияНоменклатуры,
			               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
			               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
			               |ГДЕ
			               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ФормированиеРезерваТовары.Номенклатура,
			               |	ФормированиеРезерваТовары.Характеристика,
			               |	ФормированиеРезерваТовары.СерияНоменклатуры,
			               |	ФормированиеРезерваТовары.Ссылка.Склад
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Номенклатура,
			               |	ВТ.Склад,
			               |	СУММА(ВТ.Количество) КАК Количество,
			               |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
			               |	ВТ.Характеристика,
			               |	ВТ.СерияНоменклатуры
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
			               |				&МоментВремени,
			               |				Склад В
			               |						(ВЫБРАТЬ
			               |							ВТ.Склад
			               |						ИЗ
			               |							ВТ)
			               |					И Номенклатура В
			               |						(ВЫБРАТЬ
			               |							ВТ.Номенклатура
			               |						ИЗ
			               |							ВТ)) КАК СвободныеОстаткиОстатки
			               |		ПО ВТ.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
			               |			И ВТ.Склад = СвободныеОстаткиОстатки.Склад
			               |			И ВТ.Характеристика = СвободныеОстаткиОстатки.ХарактеристикаНоменклатуры
			               |			И ВТ.СерияНоменклатуры = СвободныеОстаткиОстатки.СерияНоменклатуры
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ.Номенклатура,
			               |	ВТ.Склад,
			               |	ВТ.Характеристика,
			               |	ВТ.СерияНоменклатуры
			               |
			               |ДЛЯ ИЗМЕНЕНИЯ
			               |	РегистрНакопления.СвободныеОстатки.Остатки";
						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не хватает " + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование + " количество для списания = "+Выборка.Количество + ", количество в свободном остатке = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;



					
			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Приход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;		


			КонецЦикла;
			
			
			
	ИначеЕсли ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.СнятиеРезерва Тогда		
		
		
		Запрос = новый Запрос;
			
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры,
		               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
		               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
		               |ГДЕ
		               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Ссылка.Склад,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	СУММА(ВТ.Количество) КАК Количество,
		               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		               |				&МоментВремени,
		               |				Склад В
		               |						(ВЫБРАТЬ
		               |							ВТ.Склад
		               |						ИЗ
		               |							ВТ)
		               |					И Номенклатура В
		               |						(ВЫБРАТЬ
		               |							ВТ.Номенклатура
		               |						ИЗ
		               |							ВТ)) КАК ТоварыВРезервеНаСкладах
		               |		ПО ВТ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
		               |			И ВТ.Склад = ТоварыВРезервеНаСкладах.Склад
		               |			И ВТ.Характеристика = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
		               |			И ВТ.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки";

						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не достаточно резерва  " + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование + " количество для снятие резерва = "+Выборка.Количество + ", количество в резерве = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;



					
			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Расход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;		

			КонецЦикла;
			
	ИначеЕсли ВидОперации=Перечисления.ttk_ФормированиеРезерваВидОперации.ПеремещениеРезерва Тогда
		
		
		
		Запрос = новый Запрос;
			
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры,
		               |	ФормированиеРезерваТовары.Ссылка.Склад КАК Склад,
		               |	СУММА(ФормированиеРезерваТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.ttk_ФормированиеРезерва.Номенклатура КАК ФормированиеРезерваТовары
		               |ГДЕ
		               |	ФормированиеРезерваТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ФормированиеРезерваТовары.Номенклатура,
		               |	ФормированиеРезерваТовары.Ссылка.Склад,
		               |	ФормированиеРезерваТовары.Характеристика,
		               |	ФормированиеРезерваТовары.СерияНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	СУММА(ВТ.Количество) КАК Количество,
		               |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		               |				&МоментВремени,
		               |				Склад В
		               |						(ВЫБРАТЬ
		               |							ВТ.Склад
		               |						ИЗ
		               |							ВТ)
		               |					И Номенклатура В
		               |						(ВЫБРАТЬ
		               |							ВТ.Номенклатура
		               |						ИЗ
		               |							ВТ)
		               |					И ДокументРезерва = &ЗаказСписания) КАК ТоварыВРезервеНаСкладах
		               |		ПО ВТ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
		               |			И ВТ.Склад = ТоварыВРезервеНаСкладах.Склад
		               |			И ВТ.Характеристика = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
		               |			И ВТ.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Номенклатура,
		               |	ВТ.Склад,
		               |	ВТ.Характеристика,
		               |	ВТ.СерияНоменклатуры
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки";

						   
						   
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая)); 
			Запрос.УстановитьПараметр("ЗаказСписания", 	Заказ); 

			
			Выборка = Запрос.Выполнить().Выбрать();	
			
			

			Пока Выборка.Следующий()  Цикл
				
				Если ВЫборка.КоличествоОстаток < Выборка.Количество   Тогда
					
					Сообщить(" Не достаточно резерва по заказу:  "+Заказ.Номер+" от "+Заказ.Дата+" по номенклатуре " + Символы.ПС + Выборка.Номенклатура.НаименованиеПолное + " на складе " + Выборка.Склад.Наименование  +" количество для снятие резерва = "+Выборка.Количество + ", количество в резерве = "+ Выборка.КоличествоОстаток);
					
					Отказ = Истина;
					
					Продолжить;
					
				КонецЕсли;	

			КонецЦикла;
			
			Если не ЗначениеЗАполнено(ЗаказПриемник) Тогда
				
				Сообщить("Не указан заказ на перемещение! Проведение отменено!");
					
				Отказ = Истина;

				
			КонецЕсли;


			Для Каждого ТекСтрокаТовары Из Номенклатура Цикл
				
				
				// Спишем резерв с заказа источника 
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Расход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
							
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
						
				ДвижениеТОварыВРезерве.ДокументРезерва 				= Заказ;
				
				
				//Добавим резерв в заказ применик
				
				ДвижениеТОварыВРезерве = Движения.ТоварыВРезервеНаСкладах.Добавить();
				
				ДвижениеТОварыВРезерве.ВидДвижения 					= ВидДвиженияНакопления.Приход;
				ДвижениеТОварыВРезерве.Период 	 					= Дата;
				ДвижениеТОварыВРезерве.Склад 						= Склад;
				
				ДвижениеТОварыВРезерве.Номенклатура 				= ТекСтрокаТовары.Номенклатура;
				
				ДвижениеТОварыВРезерве.ХарактеристикаНоменклатуры	= ТекСтрокаТовары.Характеристика;

				ДвижениеТОварыВРезерве.СерияНоменклатуры			= ТекСтрокаТовары.СерияНоменклатуры;

				ДвижениеТОварыВРезерве.Количество   				= ТекСтрокаТовары.Количество;
				
				ДвижениеТОварыВРезерве.ДокументРезерва 				= ЗаказПриемник;

		
			КонецЦикла;

		
			
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		
		Заказ = ДанныеЗаполнения.Ссылка;
		
		Если ТипЗнч(ДанныеЗаполнения.СкладГруппа) = Тип("СправочникСсылка.Склады") Тогда

			 Склад = ДанныеЗаполнения.СкладГруппа ;
			
		КонецЕсли;
				
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЭтотОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	
КонецПроцедуры
